# Pandas

Pandas is a powerul data manuipulation library in Python, widely used for data analysis and data cleaning.
It provides two primary data structures

Series and Data Frame.

A series is a one dimensional array like object, while a Data Frame is two dimensional, size mutable and 
potentially heterogeneous tabular data structure with labeled axes (rows and columns)

### Series

In [6]:
import pandas as pd ## importing pandas pd is alias

data = [1,2,3,4,5]
txt = pd.Series(data)
print(txt)
print(type(txt))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
## creating a serires from dictionary element

data2 = {'a':1, 'b':2, 'c':3}
pd.Series(data2)
print(pd.Series(data2))

a    1
b    2
c    3
dtype: int64

In [13]:
data3 = [10, 20, 30]
index = ['a','b','c']
pd.Series(data3,index=index)

a    10
b    20
c    30
dtype: int64

### Data Frame

In [16]:
## dataframe
## create a dataframe from a dictionary of list

data4 = {
    'Name':['Krishna','Johnny','Jack'],
    'Age':[24,56,78],
    'City':['NewYork','Texas','Atlanta']
}

df = pd.DataFrame(data4)
print(df)
print(type(df))

      Name  Age     City
0  Krishna   24  NewYork
1   Johnny   56    Texas
2     Jack   78  Atlanta
<class 'pandas.core.frame.DataFrame'>

In [19]:
# you can also use numpy

import numpy as np
np.array(df)
print("\n")
print(np.array(df))

[['Krishna' 24 'NewYork']
 ['Johnny' 56 'Texas']
 ['Jack' 78 'Atlanta']]

In [22]:
## Create a Data Framefrom a list of dictonaries

data5 = [
    {'Name':'Krishna','Age':32 ,'City': 'Banlgore'},
    {'Name':'Kalpa','Age':37 ,'City': 'Banlgore'},
    {'Name':'Kamsa','Age':35 ,'City': 'Banlgore'},
    {'Name':'Neel','Age':34 ,'City': 'Banlgore'}
]

print(pd.DataFrame(data5))

      Name  Age      City
0  Krishna   32  Banlgore
1    Kalpa   37  Banlgore
2    Kamsa   35  Banlgore
3     Neel   34  Banlgore

In [31]:
import os                ## import os library
print(os.getcwd())       ## os.getcwd is to get current working directory

d:\Softwares\VSCode

In [34]:
df = pd.read_csv("C:/Users/rahim/Desktop/Python/DataCleaning/data.csv")
print(df.head(5))

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [36]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [38]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [43]:
## Accesing data from DataFrame
data4 = {
    'Name':['Krishna','Johnny','Jack'],
    'Age':[24,56,78],
    'City':['NewYork','Texas','Atlanta']
}

df = pd.DataFrame(data4)

df  ## it just prints like that

      Name  Age     City
0  Krishna   24  NewYork
1   Johnny   56    Texas
2     Jack   78  Atlanta

In [45]:
df['Name']

0    Krishna
1     Johnny
2       Jack
Name: Name, dtype: object

In [47]:
type(df['Name'])

pandas.core.series.Series

In [49]:
df.loc[0]

Name    Krishna
Age          24
City    NewYork
Name: 0, dtype: object

In [53]:
df.iloc[2]

Name       Jack
Age          78
City    Atlanta
Name: 2, dtype: object

In [59]:
df.loc[0][0]

C:\Users\rahim\AppData\Local\Temp\ipykernel_11180\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krishna'

In [ ]:
df.iloc[0][2]   #index loc

C:\Users\rahim\AppData\Local\Temp\ipykernel_11180\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'NewYork'

In [72]:
## Accessing a specified element 

print(df.at[2,'Age'])

78

In [75]:
df.iat[2,2] ## accesing element using iat with row and column index

'Atlanta'

### Data Manipulation with Data Frame

In [76]:
df

      Name  Age     City
0  Krishna   24  NewYork
1   Johnny   56    Texas
2     Jack   78  Atlanta

In [78]:
df['Salary'] = [50000,60000,70000]
df

      Name  Age     City  Salary
0  Krishna   24  NewYork   50000
1   Johnny   56    Texas   60000
2     Jack   78  Atlanta   70000

In [ ]:
df.drop('Salary')  ##actually gives error since becuase this pandas serches in row wise. where we did not have any infomatino in row leve

# now to overcome this we need to add axis=1.

KeyError: "['Salary'] not found in axis"

In [82]:
df.drop('Salary',axis=1) #now you can see that Salary column gor dropped.

      Name  Age     City
0  Krishna   24  NewYork
1   Johnny   56    Texas
2     Jack   78  Atlanta

In [ ]:
df ## again here Salarys shows. here action is not permanent. to make it permanenet.  we must use inplace=True

      Name  Age     City  Salary
0  Krishna   24  NewYork   50000
1   Johnny   56    Texas   60000
2     Jack   78  Atlanta   70000

In [85]:
df.drop('Salary', axis=1, inplace=True)

In [ ]:
df ## now it rmmoves permanently

      Name  Age     City
0  Krishna   27  NewYork
1   Johnny   59    Texas
2     Jack   81  Atlanta

In [89]:
## add age to column

df['Age'] = df['Age']+1
df

      Name  Age     City
0  Krishna   27  NewYork
1   Johnny   59    Texas
2     Jack   81  Atlanta

In [91]:
## dropping ase on row
df.drop(0)

     Name  Age     City
1  Johnny   59    Texas
2    Jack   81  Atlanta

In [92]:
df

      Name  Age     City
0  Krishna   27  NewYork
1   Johnny   59    Texas
2     Jack   81  Atlanta

In [93]:
df.drop(0,inplace=True)

In [94]:
df

     Name  Age     City
1  Johnny   59    Texas
2    Jack   81  Atlanta

In [96]:
df = pd.read_csv("C:/Users/rahim/Desktop/Python/DataCleaning/data.csv")
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [97]:
## Display the data types of each column
print("Data Types: \n", df.dtypes)

## Describe the DataFrame
print("Statistical summary :\n ", df.describe())

Data Types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary :
             Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [98]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000